// Πληροφορίες από πραγματικές παραστάσεις
const shows =
{
    "don-giovanni": {
        "name": "Ντον Τζοβάννι",
        "composer": "Βόλφγκανγκ Αμαντέους Μότσαρτ",
        "libretto": "Λορένζο ντα Πόντε",
        "room":"Κεντρική σκηνή",
        "mounth":"Απρίλιος 2021",
        "photo":"/assets/don-joviani.jpeg",
        "production": "Συμπαραγωγή με την Όπερα του Γκαίτεμποργκ (Σουηδία) και τη Βασιλική Όπερα της Δανίας",
        "description": `Η νέα παραγωγή του Ντον Τζοβάννι του Μότσαρτ αποτελεί μια μεγάλη διεθνή συμπαραγωγή της Εθνικής Λυρικής Σκηνής με δύο σημαντικά βορειοευρωπαϊκά λυρικά θέατρα, την Όπερα του Γκαίτεμποργκ και τη Βασιλική Όπερα της Δανίας. Τη σκηνοθεσία υπογράφει ο διακεκριμένος σκηνοθέτης και καλλιτεχνικός διευθυντής της Βασιλικής Όπερας της Δανίας Τζων Φούλτζεϊμς. Η παραγωγή, μετά την αθηναϊκή πρεμιέρα του Δεκεμβρίου του 2021, θα παρουσιαστεί σε Γκαίτεμποργκ και Κοπεγχάγη. O Φούλτζεϊμς τοποθετεί τη δράση της όπερας σε ένα σημερινό ξενοδοχείο, έναν μικρόκοσμο μιας πόλης, έναν τόπο συνάντησης ανθρώπων, όπου το ιδιωτικό γίνεται δημόσιο και ο χρόνος παραμονής είναι περιορισμένος. Ο σκηνοθέτης σημειώνει: «Ο Ντον Τζοβάννι είναι μια όπερα που διαρκεί στον χρόνο επειδή είναι πολύπλευρη· έχει πολύ χιούμορ και σπουδαία θεατρικά σκηνικά, όλα ενταγμένα μέσα σε μια σκοτεινή ιστορία μυστηρίου για έναν αποπλανητή που κάποιος πρέπει να τον σταματήσει. Είναι ένα έργο για το πώς ζούμε μαζί στην κοινωνία και, όπως συμβαίνει πάντα με την όπερα, για το πώς αντιμετωπίζουμε τον θάνατο. Η κορύφωσή του έγκειται στον πολυαναμενόμενο θάνατο του ίδιου του Ντον Τζοβάννι, καθώς προτιμάει τον θάνατο, ακόμα και την κόλαση, από το να απαρνηθεί το ποιος είναι. Ο θάνατός του είναι μια έκφραση της τάξης που επανεπιβεβαιώνει την ισχύ της έναντι της αχαλίνωτης ελευθερίας που εκείνος αντιπροσωπεύει». Στον Ντον Τζοβάννι –ένα από τα ορόσημα του οπερατικού ρεπερτορίου– ο Μότσαρτ αποδίδει με τη μουσική του όλες τις όψεις της πορείας του ανθρώπου που τα βάζει με τον Θεό και παίρνει την τύχη του στα χέρια του.`,
        "dates": ["2021-4-12", "2021-4-13", "2021-4-16", "2021-4-18", "2021-4-20", "2021-4-22", "2021-4-27", "2021-4-29"],
        "crew": {
            "conductor": "Ντάνιελ Σμιθ",
            "director": "Τζων Φούλτζεϊμς",
            "associate director": "Αϋλίν Μπόζοκ",
            "sets": "Ντικ Μπερντ",
            "costumes": "Άνμαρι Γουντς",
            "choreographer": "Μαξίν Μπρέιαμ",
            "lighting designer": "Φαμπιάνα Πιτσόλι",
            "video designer": "Ουίλ Ντιούκ",
            "programmer video": "Νταν Τρέντσαρντ",
            "chorus master": "Αγαθάγγελος Γεωργακάτος",
        },
        "roles": {
            "Ντον Τζοβάννι": {
                "Τάσης Χριστογιαννόπουλος": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Διονύσης Σούρμπης": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Ντόννα Άννα": {
                "Βασιλική Καραγιάννη": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Σιρανούς Τσαλικιάν": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Ντον Οττάβιο": {
                "Γιάννης Χριστόπουλος ": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Βασίλης Καβάγιας": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Διοικητής": {
                "Πέτρος Μαγουλάς": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Αλέξανδρος Σταυρακάκης": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Ντόννα Ελβίρα": {
                "Άννα Στυλιανάκη": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Άρτεμις Μπόγρη": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Λεπορέλλο": {
                "Τάσος Αποστόλου": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Χάρης Ανδριανός": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Μαζέττο": {
                "Νίκος Κοτενίδης": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Γιώργος Ματθαιακάκης": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
            "Tσερλίνα": {
                "Χρύσα Μαλιαμάνη": ["2021-4-12", "2021-4-16", "2021-4-20", "2021-4-27"],
                "Μιράντα Μακρυνιώτη": ["2021-4-13", "2021-4-18", "2021-4-22", "2021-4-29"]
            },
        }
    },
    "mantama-batterflai": {
        "name": "Μαντάμα Μπαττερφλάι",
        "composer": "Τζάκομο Πουτσίνι",
        "libretto": "Λουίτζι Ίλικα και Τζουζέπε Τζακόζα",
        "room":"Σταύρος Νίαρχος",
        "mounth":"Απρίλιος 2021",
        "photo":"/assets/madama-butterfly.jpeg",
        "production": "Εθνική Λυρική Σκηνή",
        "description": `Η υπόθεση της όπερας αφορά τον μοιραίο έρωτα της δεκαπεντάχρονης γκέισας Τσο-Τσο-Σαν για τον Πίνκερτον, υποπλοίαρχο του Ναυτικού των Ηνωμένων Πολιτειών της Αμερικής. Ύστερα από τρία χρόνια απουσίας, ο αξιωματικός επιστρέφει με την Αμερικανίδα σύζυγό του στην Ιαπωνία, μαθαίνοντας ότι έχει αποκτήσει γιο από την Μπαττερφλάι. Εκείνη δέχεται να παραδώσει το παιδί μονάχα στον ίδιο τον Πίνκερτον και στη συνέχεια αυτοκτονεί. Διάσημη για τις υπέροχες άριες, την πρόδηλα μελωδική μουσική και τη δραματική θεατρικότητά της, η Μαντάμα Μπαττερφλάι συγκινεί διαχρονικά και προκαλεί έντονα συναισθήματα. Ο Πουτσίνι δεν διστάζει να τη χαρακτηρίσει ως την πιο αγαπημένη του όπερα, ενώ με τις μετέπειτα τροποποιήσεις ανάγει την αλαβάστρινη μορφή της ηρωίδας του σε σύμβολο ανεξάντλητης υπομονής και αιώνιας, σταθερής αγάπης. Τη σκηνοθεσία, τα σκηνικά και τα κοστούμια της παραγωγής, η οποία πρωτοπαρουσιάστηκε το 2013 στο Ηρώδειο, και τώρα αναβιώνει σε μια νέα εκδοχή για τη σκηνή της Αίθουσας Σταύρος Νιάρχος, υπογράφει ο διάσημος Αργεντινός σκηνοθέτης Ούγκο ντε Άνα. Πρόκειται για μια εντυπωσιακή παραγωγή με παραδοσιακά γιαπωνέζικα κοστούμια, ενώ τα σκηνικά και οι προβολές εικονοποιούν με εντυπωσιακό τρόπο τη χώρα του ανατέλλοντος ηλίου από τη μια και τον ψυχισμό της ηρωίδας από την άλλη. Τις προβολές υπογράφει ο Σέρτζιο Μετάλλι, ενώ τους φωτισμούς ο Βαλέριο Αλφιέρι.`,
        "dates": ["2021-4-14", "2021-4-16", "2021-4-18", "2021-4-20", "2021-4-23", "2021-4-25", "2021-4-30", "2021-5-01", "2021-5-08", "2021-5-15"],
        "crew": {
            "conductor": "Λουκάς Καρυτινός",
            "director": "Ούγκο ντε Άνα",
            "video projection designer": "Σέρτζιο Μετάλλι - Ideogamma SRL",
            "sets": "Ούγκο ντε Άνα",
            "costumes": "Ούγκο ντε Άνα",
            "lighting designer": "Βαλέριο Αλφιέρι",
            "chorus master": "Αγαθάγγελος Γεωργακάτος",
        },
        "roles": {
            "Τσο-Τσο-Σαν":
            {
                "Ερμονέλα Γιάχο": ["2021-4-14", "2021-4-16", "2021-4-25", "2021-4-25"],
                "Τσέλια Κοστέα": ["2021-4-15"],
                "Κριστίνε Οπολάις": ["2021-4-18", "2021-4-23", "2021-4-30", "2021-5-01", "2021-5-11"],
            },
            "Σουτζούκι": {
                "Χρυσάνθη Σπιτάδη": ["2021-4-14", "2021-4-16", "2021-4-18", "2021-4-25", "2021-4-23", "2021-4-25", "2021-4-30", , "2021-5-01", "2021-5-08", "2021-5-15"]
            },
            "Κέιτ Πίνκερτον": {
                "Βιολέττα Λούστα": ["2021-4-16", "2021-4-18", "2021-4-25", "2021-4-23", "2021-4-25"],
                "Διαμάντη Κριτσωτάκη": ["2021-4-14", "2021-4-30", "2021-5-01", "2021-5-08", "2021-5-15"]
            },
            "Μ.Φ.Πίνκερτον": {
                "Τζανλούκα Τερρανόβα": ["2021-4-16", "2021-4-25", "2021-4-23", "2021-4-25"],
                "Δημήτρης Πακσόγλου": ["2021-4-14", "2021-4-18", "2021-4-30", "2021-5-01", "2021-5-08", "2021-5-15"]
            },
            "Σάρπλες": {
                "Διονύσης Σούρμπης": ["2021-4-16", "2021-4-25", "2021-4-23", "2021-4-25"],
                "Νίκος Κοτενίδης": ["2021-4-14", "2021-4-18", "2021-4-30", "2021-5-01", "2021-5-08", "2021-5-15"]
            },
            "Γκόρο": {
                "Νίκος Στεφάνου": ["2021-4-16", "2021-4-25", "2021-4-23", "2021-4-25"],
                "Γιάννης Καλύβας": ["2021-4-14", "2021-4-18", "2021-4-30", "2021-5-01", "2021-5-08", "2021-5-15"]
            },
            "Πρίγκιπας Γιαμαντόρι": {
                "Μάριος Σαραντίδης": [],
            },
            "Μπόνζο": {
                "Γιάννης Γιαννίσης": ["2021-4-16", "2021-4-25", "2021-4-23", "2021-4-25", "2021-5-01"],
                "Δημήτρης Κασιούμης": ["2021-4-14", "2021-4-18", "2021-4-30", "2021-5-08", "2021-5-15"]
            },
            "Γιακουζιντέ": {
                "Πέτρος Σαλάτας": [],
            },
            "Αυτοκρατορικός Επίτροπος": {
                "Διονύσης Τσαντίνης": ["2021-4-16", "2021-4-25", "2021-4-25", "2021-5-01", "2021-5-15"],
                "Γιώργος Παπαδημητρίου": ["2021-4-14", "2021-4-18", "2021-4-23", "2021-4-30", "2021-5-08"]
            },
            "Ληξίαρχος": {
                "Θεόδωρος Αϊβαλιώτης": ["2021-4-16", "2021-4-25", "2021-4-25", "2021-5-01", "2021-5-15"],
                "Θεόδωρος Μωραΐτης": ["2021-4-14", "2021-4-18", "2021-4-23", "2021-4-30", "2021-5-08"]
            },
            "Μητέρα της Τσο - Τσο - Σαν": {
                "Αμαλία Αυλωνίτη": ["2021-4-16", "2021-4-25", "2021-4-25", "2021-5-01", "2021-5-15"],
                "Ζωή Απειρανθίτου": ["2021-4-14", "2021-4-18", "2021-4-23", "2021-4-30", "2021-5-08"]

            },
            "Θεία": {
                "Βάγια Κωφού": ["2021-4-16", "2021-4-25", "2021-4-25", "2021-5-01", "2021-5-15"],
                "Ελισάβετ Κλονόφσκαγια": ["2021-4-14", "2021-4-18", "2021-4-23", "2021-4-30", "2021-5-08"]
            },
            "Ξαδέρφη": {
                "Φωτεινή Χατζιδάκη": ["2021-4-16", "2021-4-25", "2021-4-25", "2021-5-01", "2021-5-15"],
                "Θέη Σταύρου": ["2021-4-14", "2021-4-18", "2021-4-23", "2021-4-30", "2021-5-08"]
            },
        }
    }
};